src/cf/DataProcessors/КартаЗвездногоНеба.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>КартаЗвездногоНеба</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяПланета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВозможныеНаправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПланетаНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Планеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяТоплива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/КартаЗвездногоНеба/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьКарту();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Полетели(Команда)
	
	ТекущаяСтрока = Элементы.ВозможныеНаправления.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолетелиНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолетелиНаСервере(ИдентификаторСтрокиНаправления)
	
	ТекущаяСтрока = Объект.ВозможныеНаправления.НайтиПоИдентификатору(ИдентификаторСтрокиНаправления);
	
	Если ТекущаяСтрока.ТребуетсяТоплива > Объект.ОстатокТоплива Тогда
		ВызватьИсключение НСтр("ru = 'Топлива не достаточно!'");
	КонецЕсли;
	
	Местоположение = Новый Структура;
	Местоположение.Вставить("ТекущаяПланета", Объект.ТекущаяПланета);
	Местоположение.Вставить("ПанетаНазначения", ТекущаяСтрока.ПланетаНазначения);
	Местоположение.Вставить("ПотраченоТоплива", ТекущаяСтрока.ТребуетсяТоплива);
	КартаЗвездногоНебаПереопределяемый.ПриУстановкеМестоположения(Местоположение);
	
	ОбновитьКарту();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКарту()
	
	Местоположение = Новый Структура;
	Местоположение.Вставить("ТекущаяПланета", Справочники.Планеты.ПустаяСсылка());
	Местоположение.Вставить("ТекущийЗапасТоплива", 0);
	КартаЗвездногоНебаПереопределяемый.ПриОпределенииМестоположения(Местоположение);
	Объект.ТекущаяПланета = Местоположение.ТекущаяПланета;
	Объект.ОстатокТоплива = Местоположение.ТекущийЗапасТоплива;
	
	СтоимостиПеремещений = Обработки.КартаЗвездногоНеба.СтоимостиПеремещенийПоНаправлениям(Объект.ТекущаяПланета);
	Объект.ВозможныеНаправления.Загрузить(СтоимостиПеремещений);
	
КонецПроцедуры

#КонецОбласти
